stergiosba/State-Estimation-EtherCAT/ADIS16375_IMU_ECAT_SLAVE_F28388D_CPU/device/driverlib/inc/hw_sdfm.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the SDFLT4CMPL2 register
//
//*************************************************************************************************
#define SDFM_SDFLT4CMPL2_LLT2_S   0U
#define SDFM_SDFLT4CMPL2_LLT2_M   0x7FFFU   // Second low-level threshold for the comparator filter
                                            // output.

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDCOMP1CTL register
//
//*************************************************************************************************
#define SDFM_SDCOMP1CTL_CEVT1DIGFILTSEL_S   2U
#define SDFM_SDCOMP1CTL_CEVT1DIGFILTSEL_M   0xCU     // High Comparator Trip Select
#define SDFM_SDCOMP1CTL_CEVT2DIGFILTSEL_S   10U
#define SDFM_SDCOMP1CTL_CEVT2DIGFILTSEL_M   0xC00U   // Low Comparator Trip Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDCOMP1EVT2FLTCTL register
//
//*************************************************************************************************
#define SDFM_SDCOMP1EVT2FLTCTL_SAMPWIN_S   4U
#define SDFM_SDCOMP1EVT2FLTCTL_SAMPWIN_M   0x1F0U    // Sample Window
#define SDFM_SDCOMP1EVT2FLTCTL_THRESH_S    9U
#define SDFM_SDCOMP1EVT2FLTCTL_THRESH_M    0x3E00U   // Majority Voting Threshold
#define SDFM_SDCOMP1EVT2FLTCTL_FILINIT     0x8000U   // Filter Initialization Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDCOMP1EVT2FLTCLKCTL register
//
//*************************************************************************************************
#define SDFM_SDCOMP1EVT2FLTCLKCTL_CLKPRESCALE_S   0U
#define SDFM_SDCOMP1EVT2FLTCLKCTL_CLKPRESCALE_M   0x3FFU   // Sample Clock Prescale

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDCOMP1EVT1FLTCTL register
//
//*************************************************************************************************
#define SDFM_SDCOMP1EVT1FLTCTL_SAMPWIN_S   4U
#define SDFM_SDCOMP1EVT1FLTCTL_SAMPWIN_M   0x1F0U    // Sample Window
#define SDFM_SDCOMP1EVT1FLTCTL_THRESH_S    9U
#define SDFM_SDCOMP1EVT1FLTCTL_THRESH_M    0x3E00U   // Majority Voting Threshold
#define SDFM_SDCOMP1EVT1FLTCTL_FILINIT     0x8000U   // Filter Initialization Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDCOMP1EVT1FLTCLKCTL register
//
//*************************************************************************************************
#define SDFM_SDCOMP1EVT1FLTCLKCTL_CLKPRESCALE_S   0U
#define SDFM_SDCOMP1EVT1FLTCLKCTL_CLKPRESCALE_M   0x3FFU   // Sample Clock Prescale

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDCOMP1LOCK register
//
//*************************************************************************************************
#define SDFM_SDCOMP1LOCK_SDCOMP1CTL   0x1U   // COMPCTL Lock
#define SDFM_SDCOMP1LOCK_COMP         0x8U   // COMPevent filter registers Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDCOMP2CTL register
//
//*************************************************************************************************
#define SDFM_SDCOMP2CTL_CEVT1DIGFILTSEL_S   2U
#define SDFM_SDCOMP2CTL_CEVT1DIGFILTSEL_M   0xCU     // High Comparator Trip Select
#define SDFM_SDCOMP2CTL_CEVT2DIGFILTSEL_S   10U
#define SDFM_SDCOMP2CTL_CEVT2DIGFILTSEL_M   0xC00U   // Low Comparator Trip Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDCOMP2EVT2FLTCTL register
//
//*************************************************************************************************
#define SDFM_SDCOMP2EVT2FLTCTL_SAMPWIN_S   4U
#define SDFM_SDCOMP2EVT2FLTCTL_SAMPWIN_M   0x1F0U    // Sample Window
#define SDFM_SDCOMP2EVT2FLTCTL_THRESH_S    9U
#define SDFM_SDCOMP2EVT2FLTCTL_THRESH_M    0x3E00U   // Majority Voting Threshold
#define SDFM_SDCOMP2EVT2FLTCTL_FILINIT     0x8000U   // Filter Initialization Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDCOMP2EVT2FLTCLKCTL register
//
//*************************************************************************************************
#define SDFM_SDCOMP2EVT2FLTCLKCTL_CLKPRESCALE_S   0U
#define SDFM_SDCOMP2EVT2FLTCLKCTL_CLKPRESCALE_M   0x3FFU   // Sample Clock Prescale

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDCOMP2EVT1FLTCTL register
//
//*************************************************************************************************
#define SDFM_SDCOMP2EVT1FLTCTL_SAMPWIN_S   4U
#define SDFM_SDCOMP2EVT1FLTCTL_SAMPWIN_M   0x1F0U    // Sample Window
#define SDFM_SDCOMP2EVT1FLTCTL_THRESH_S    9U
#define SDFM_SDCOMP2EVT1FLTCTL_THRESH_M    0x3E00U   // Majority Voting Threshold
#define SDFM_SDCOMP2EVT1FLTCTL_FILINIT     0x8000U   // Filter Initialization Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDCOMP2EVT1FLTCLKCTL register
//
//*************************************************************************************************
#define SDFM_SDCOMP2EVT1FLTCLKCTL_CLKPRESCALE_S   0U
#define SDFM_SDCOMP2EVT1FLTCLKCTL_CLKPRESCALE_M   0x3FFU   // Sample Clock Prescale

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDCOMP2LOCK register
//
//*************************************************************************************************
#define SDFM_SDCOMP2LOCK_SDCOMP2CTL   0x1U   // COMPCTL Lock
#define SDFM_SDCOMP2LOCK_COMP         0x8U   // COMPevent filter registers Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDCOMP3CTL register
//
//*************************************************************************************************
#define SDFM_SDCOMP3CTL_CEVT1DIGFILTSEL_S   2U
#define SDFM_SDCOMP3CTL_CEVT1DIGFILTSEL_M   0xCU     // High Comparator Trip Select
#define SDFM_SDCOMP3CTL_CEVT2DIGFILTSEL_S   10U
#define SDFM_SDCOMP3CTL_CEVT2DIGFILTSEL_M   0xC00U   // Low Comparator Trip Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDCOMP3EVT2FLTCTL register
//
//*************************************************************************************************
#define SDFM_SDCOMP3EVT2FLTCTL_SAMPWIN_S   4U
#define SDFM_SDCOMP3EVT2FLTCTL_SAMPWIN_M   0x1F0U    // Sample Window
#define SDFM_SDCOMP3EVT2FLTCTL_THRESH_S    9U
#define SDFM_SDCOMP3EVT2FLTCTL_THRESH_M    0x3E00U   // Majority Voting Threshold
#define SDFM_SDCOMP3EVT2FLTCTL_FILINIT     0x8000U   // Filter Initialization Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDCOMP3EVT2FLTCLKCTL register
//
//*************************************************************************************************
#define SDFM_SDCOMP3EVT2FLTCLKCTL_CLKPRESCALE_S   0U
#define SDFM_SDCOMP3EVT2FLTCLKCTL_CLKPRESCALE_M   0x3FFU   // Sample Clock Prescale

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDCOMP3EVT1FLTCTL register
//
//*************************************************************************************************
#define SDFM_SDCOMP3EVT1FLTCTL_SAMPWIN_S   4U
#define SDFM_SDCOMP3EVT1FLTCTL_SAMPWIN_M   0x1F0U    // Sample Window
#define SDFM_SDCOMP3EVT1FLTCTL_THRESH_S    9U
#define SDFM_SDCOMP3EVT1FLTCTL_THRESH_M    0x3E00U   // Majority Voting Threshold
#define SDFM_SDCOMP3EVT1FLTCTL_FILINIT     0x8000U   // Filter Initialization Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDCOMP3EVT1FLTCLKCTL register
//
//*************************************************************************************************
#define SDFM_SDCOMP3EVT1FLTCLKCTL_CLKPRESCALE_S   0U
#define SDFM_SDCOMP3EVT1FLTCLKCTL_CLKPRESCALE_M   0x3FFU   // Sample Clock Prescale

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDCOMP3LOCK register
//
//*************************************************************************************************
#define SDFM_SDCOMP3LOCK_SDCOMP3CTL   0x1U   // COMPCTL Lock
#define SDFM_SDCOMP3LOCK_COMP         0x8U   // COMPevent filter registers Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDCOMP4CTL register
//
//*************************************************************************************************
#define SDFM_SDCOMP4CTL_CEVT1DIGFILTSEL_S   2U
#define SDFM_SDCOMP4CTL_CEVT1DIGFILTSEL_M   0xCU     // High Comparator Trip Select
#define SDFM_SDCOMP4CTL_CEVT2DIGFILTSEL_S   10U
#define SDFM_SDCOMP4CTL_CEVT2DIGFILTSEL_M   0xC00U   // Low Comparator Trip Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDCOMP4EVT2FLTCTL register
//
//*************************************************************************************************
#define SDFM_SDCOMP4EVT2FLTCTL_SAMPWIN_S   4U
#define SDFM_SDCOMP4EVT2FLTCTL_SAMPWIN_M   0x1F0U    // Sample Window
#define SDFM_SDCOMP4EVT2FLTCTL_THRESH_S    9U
#define SDFM_SDCOMP4EVT2FLTCTL_THRESH_M    0x3E00U   // Majority Voting Threshold
#define SDFM_SDCOMP4EVT2FLTCTL_FILINIT     0x8000U   // Filter Initialization Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDCOMP4EVT2FLTCLKCTL register
//
//*************************************************************************************************
#define SDFM_SDCOMP4EVT2FLTCLKCTL_CLKPRESCALE_S   0U
#define SDFM_SDCOMP4EVT2FLTCLKCTL_CLKPRESCALE_M   0x3FFU   // Sample Clock Prescale

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDCOMP4EVT1FLTCTL register
//
//*************************************************************************************************
#define SDFM_SDCOMP4EVT1FLTCTL_SAMPWIN_S   4U
#define SDFM_SDCOMP4EVT1FLTCTL_SAMPWIN_M   0x1F0U    // Sample Window
#define SDFM_SDCOMP4EVT1FLTCTL_THRESH_S    9U
#define SDFM_SDCOMP4EVT1FLTCTL_THRESH_M    0x3E00U   // Majority Voting Threshold
#define SDFM_SDCOMP4EVT1FLTCTL_FILINIT     0x8000U   // Filter Initialization Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDCOMP4EVT1FLTCLKCTL register
//
//*************************************************************************************************
#define SDFM_SDCOMP4EVT1FLTCLKCTL_CLKPRESCALE_S   0U
#define SDFM_SDCOMP4EVT1FLTCLKCTL_CLKPRESCALE_M   0x3FFU   // Sample Clock Prescale

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDCOMP4LOCK register
//
//*************************************************************************************************
#define SDFM_SDCOMP4LOCK_SDCOMP4CTL   0x1U   // COMPCTL Lock
#define SDFM_SDCOMP4LOCK_COMP         0x8U   // COMPevent filter registers Lock



#endif
